uhnp/src/InformationRegisters/НастройкиСервисаПодписанияУправлениеПерсоналом/НастройкиСервисаПодписанияУправлениеПерсоналом.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиСервисаПодписанияУправлениеПерсоналом</name>
  <resources>
    <name>ИспользоватьУНЭПИнформационнойСистемы</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьПодписаниеВГосключ</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьПодписаниеВАстралПлатформа</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Приложение</name>
    <type>
      <types>EnumRef.ПриложенияДляИнтеграции</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/InformationRegisters/НастройкиСервисаПодписанияУправлениеПерсоналом/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Функция Настройки(Приложение) Экспорт
	
	Настройки = Новый Структура(
	"ИспользоватьУНЭПИнформационнойСистемы,
	|ИспользоватьПодписаниеВГосключ,
	|ИспользоватьПодписаниеВАстралПлатформа");
	
	Настройки.ИспользоватьУНЭПИнформационнойСистемы 	= Истина;
	Настройки.ИспользоватьПодписаниеВГосключ 			= Ложь;
	Настройки.ИспользоватьПодписаниеВАстралПлатформа 	= Ложь;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Приложение", Приложение);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Настройки.ИспользоватьУНЭПИнформационнойСистемы КАК ИспользоватьУНЭПИнформационнойСистемы,
	|	Настройки.ИспользоватьПодписаниеВГосключ КАК ИспользоватьПодписаниеВГосключ,
	|	Настройки.ИспользоватьПодписаниеВАстралПлатформа КАК ИспользоватьПодписаниеВАстралПлатформа
	|ИЗ
	|	РегистрСведений.НастройкиСервисаПодписанияУправлениеПерсоналом КАК Настройки
	|ГДЕ
	|	Настройки.Приложение = &Приложение";
	
	УстановитьПривилегированныйРежим(Истина);
	Выборка = Запрос.Выполнить().Выбрать();
	УстановитьПривилегированныйРежим(Ложь);
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Настройки, Выборка);
	КонецЦикла;
	
	Возврат Настройки;

КонецФункции

#КонецОбласти

#КонецЕсли
